## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.fatp_azure_web_app_services_hosting.azurerm_storage_account.logs[0] has changed
  ~ resource "azurerm_storage_account" "logs" {
        id                                = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-401/providers/Microsoft.Storage/storageAccounts/findatppr401logs"
        name                              = "findatppr401logs"
        tags                              = {
            "Environment"      = "pr-401"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (37 unchanged attributes hidden)

      ~ network_rules {
          ~ ip_rules                   = [
              - "13.87.245.145",
              + "52.160.111.23",
                # (1 unchanged element hidden)
            ]
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.fatp_azure_web_app_services_hosting.data.azurerm_storage_account_blob_container_sas.logs["app"] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_storage_account_blob_container_sas" "logs" {
      + connection_string = (sensitive value)
      + container_name    = "find-a-tp-pr-401applogs"
      + expiry            = (known after apply)
      + https_only        = true
      + id                = (known after apply)
      + sas               = (sensitive value)
      + start             = (known after apply)

      + permissions {
          + add    = true
          + create = true
          + delete = true
          + list   = true
          + read   = true
          + write  = true
        }
    }

  # module.fatp_azure_web_app_services_hosting.data.azurerm_storage_account_blob_container_sas.logs["http"] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_storage_account_blob_container_sas" "logs" {
      + connection_string = (sensitive value)
      + container_name    = "find-a-tp-pr-401httplogs"
      + expiry            = (known after apply)
      + https_only        = true
      + id                = (known after apply)
      + sas               = (sensitive value)
      + start             = (known after apply)

      + permissions {
          + add    = true
          + create = true
          + delete = true
          + list   = true
          + read   = true
          + write  = true
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_linux_function_app.default will be updated in-place
  ~ resource "azurerm_linux_function_app" "default" {
      ~ app_settings                      = {
          + "APPINSIGHTS_INSTRUMENTATIONKEY"          = (sensitive value)
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"   = (sensitive value)
            # (7 unchanged elements hidden)
        }
        id                                = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-401/providers/Microsoft.Web/sites/find-a-tp-pr-401-fa"
        name                              = "find-a-tp-pr-401-fa"
        tags                              = {
            "Environment"      = "pr-401"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (24 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string  = (sensitive value) -> null
          - application_insights_key                = (sensitive value) -> null
            # (25 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_linux_web_app.default[0] will be updated in-place
  ~ resource "azurerm_linux_web_app" "default" {
        id                                = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-401/providers/Microsoft.Web/sites/find-a-tp-pr-401"
        name                              = "find-a-tp-pr-401"
        tags                              = {
            "Environment"      = "pr-401"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (19 unchanged attributes hidden)

      ~ logs {
            # (2 unchanged attributes hidden)

          ~ application_logs {
                # (1 unchanged attribute hidden)

              ~ azure_blob_storage {
                  ~ sas_url           = (sensitive value)
                    # (2 unchanged attributes hidden)
                }
            }

          ~ http_logs {
              ~ azure_blob_storage {
                  ~ sas_url           = (sensitive value)
                    # (1 unchanged attribute hidden)
                }
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.default_key_vault[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "default_key_vault" {
        id                             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-401/providers/Microsoft.KeyVault/vaults/find-a-tp-pr-401-kv|find-a-tp-pr-401-default-kv-diag"
      + log_analytics_destination_type = "Dedicated"
        name                           = "find-a-tp-pr-401-default-kv-diag"
        # (2 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.default_postgresql_flexible_server[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "default_postgresql_flexible_server" {
      + id                             = (known after apply)
      + log_analytics_destination_type = "Dedicated"
      + log_analytics_workspace_id     = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-401/providers/Microsoft.OperationalInsights/workspaces/find-a-tp-pr-401-webappservice"
      + name                           = "find-a-tp-pr-401-postgresql-diag"
      + target_resource_id             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-401/providers/Microsoft.DBforPostgreSQL/flexibleServers/find-a-tp-pr-401-psqlflexible-server"

      + enabled_log {
          + category = "PostgreSQLFlexDatabaseXacts"

          + retention_policy {
              + enabled = true
            }
        }
      + enabled_log {
          + category = "PostgreSQLFlexQueryStoreRuntime"

          + retention_policy {
              + enabled = true
            }
        }
      + enabled_log {
          + category = "PostgreSQLFlexQueryStoreWaitStats"

          + retention_policy {
              + enabled = true
            }
        }
      + enabled_log {
          + category = "PostgreSQLFlexSessions"

          + retention_policy {
              + enabled = true
            }
        }
      + enabled_log {
          + category = "PostgreSQLFlexTableStats"

          + retention_policy {
              + enabled = true
            }
        }
      + enabled_log {
          + category = "PostgreSQLLogs"

          + retention_policy {
              + enabled = true
            }
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true

          + retention_policy {
              + enabled = true
            }
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.default_redis_cache[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "default_redis_cache" {
        id                             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-401/providers/Microsoft.Cache/redis/find-a-tp-pr-401-redis-cache|find-a-tp-pr-401-default-redis-diag"
      + log_analytics_destination_type = "Dedicated"
        name                           = "find-a-tp-pr-401-default-redis-diag"
        # (2 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.function_app[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "function_app" {
        id                             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-401/providers/Microsoft.Storage/storageAccounts/findatppr401falogs|find-a-tp-pr-401-storage-diag-fa"
      + log_analytics_destination_type = "Dedicated"
        name                           = "find-a-tp-pr-401-storage-diag-fa"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "Capacity" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - metric {
          - category = "Transaction" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = "Transaction"
          + enabled  = true

          + retention_policy {
              + enabled = true
            }
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.web_app[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "web_app" {
        id                             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-401/providers/Microsoft.Storage/storageAccounts/findatppr401logs|find-a-tp-pr-401-storage-diag"
      + log_analytics_destination_type = "Dedicated"
        name                           = "find-a-tp-pr-401-storage-diag"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "Capacity" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - metric {
          - category = "Transaction" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = "Transaction"
          + enabled  = true

          + retention_policy {
              + enabled = true
            }
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.webhook[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "webhook" {
        id                             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-401/providers/Microsoft.Logic/workflows/find-a-tp-pr-401-webhook-workflow|find-a-tp-pr-401-webhook-diag"
      + log_analytics_destination_type = "Dedicated"
        name                           = "find-a-tp-pr-401-webhook-diag"
        # (2 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_metric_alert.http[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "http" {
      ~ enabled             = false -> true
        id                  = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-401/providers/Microsoft.Insights/metricAlerts/find-a-tp-pr-401-http"
        name                = "find-a-tp-pr-401-http"
        tags                = {
            "Environment"      = "pr-401"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_metric_alert.latency[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "latency" {
      ~ enabled             = false -> true
        id                  = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-401/providers/Microsoft.Insights/metricAlerts/find-a-tp-pr-401-cdn-latency"
        name                = "find-a-tp-pr-401-cdn-latency"
        tags                = {
            "Environment"      = "pr-401"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_scheduled_query_rules_alert.email_processing_fa_error_alert[0] will be updated in-place
  ~ resource "azurerm_monitor_scheduled_query_rules_alert" "email_processing_fa_error_alert" {
      ~ enabled                 = false -> true
        id                      = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-401/providers/Microsoft.Insights/scheduledQueryRules/find-a-tp-pr-401-fa-email-processing-errors"
        name                    = "find-a-tp-pr-401-fa-email-processing-errors"
        tags                    = {
            "Environment"      = "pr-401"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_scheduled_query_rules_alert.function_app_down_alert[0] will be updated in-place
  ~ resource "azurerm_monitor_scheduled_query_rules_alert" "function_app_down_alert" {
      ~ enabled                 = false -> true
        id                      = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-401/providers/Microsoft.Insights/scheduledQueryRules/find-a-tp-pr-401-faapp-down"
        name                    = "find-a-tp-pr-401-faapp-down"
        tags                    = {
            "Environment"      = "pr-401"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_scheduled_query_rules_alert.web_app_service[0] will be updated in-place
  ~ resource "azurerm_monitor_scheduled_query_rules_alert" "web_app_service" {
      ~ enabled                 = false -> true
        id                      = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-401/providers/Microsoft.Insights/scheduledQueryRules/find-a-tp-pr-401-webapp-errors"
        name                    = "find-a-tp-pr-401-webapp-errors"
        tags                    = {
            "Environment"      = "pr-401"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_resource_group.default[0] will be updated in-place
  ~ resource "azurerm_resource_group" "default" {
        id       = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-401"
        name     = "s177d01-ntp-pr-401"
      ~ tags     = {
          ~ "Environment"      = "Dev" -> "pr-401"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (1 unchanged attribute hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_storage_account_network_rules.logs[0] will be updated in-place
  ~ resource "azurerm_storage_account_network_rules" "logs" {
        id                         = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-401/providers/Microsoft.Storage/storageAccounts/findatppr401logs"
      ~ ip_rules                   = [
          - "52.160.111.23",
            # (1 unchanged element hidden)
        ]
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 14 to change, 0 to destroy.
```
</details>